# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'espanso/espanso'

# Binaries
brew 'antigen'
brew 'bat'
brew 'coreutils'
brew 'ctop'
brew 'dark-mode'
brew 'diff-so-fancy'
brew 'dockutil'
brew 'espanso'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'ffsend'
brew 'fpp'
brew 'fzf'
brew 'gh'
brew 'git-recent'
brew 'git'
brew 'grep'
brew 'grip'
brew 'hstr'
brew 'hr'
brew 'httpie'
brew 'hyperfine'
brew 'imagemagick'
brew 'mas'
brew 'moreutils'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'tokei'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'wifi-password'
brew 'xsv'
brew 'youtube-dl'
brew 'z'
brew 'zsh-completions'
brew 'zsh'

# Dev
brew 'mysql'
brew 'node'
brew 'php'
brew 'python'

# Apps
cask 'alfred'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'homebrew/cask-versions/google-chrome-canary'
cask 'brave-browser'
cask 'cleanapp'
cask 'colorpicker-skalacolor'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'dropshare'
cask 'firefox'
cask 'figma'
cask 'font-ibm-plex'
cask 'google-chrome'
cask 'grammarly'
cask 'hyperkey'
cask 'insomnia'
cask 'iterm2'
cask 'kap'
cask 'keyboard-maestro'
cask 'linear-linear'
cask 'microsoft-teams'
cask 'notion'
cask 'numi'
cask 'opera'
cask 'plex'
cask 'postman'
cask 'screenflow'
cask 'spectacle'
cask 'spotify'
cask 'tableplus'
cask 'telegram'
cask 'the-unarchiver'
cask 'viber'
cask 'visual-studio-code'
cask 'vlc'

# Install manually
# Bartender, https://www.macbartender.com/
# iStat-Menus, https://bjango.com/mac/istatmenus/
# Transmit, https://panic.com/transmit/
# Super Hexagon, https://apps.apple.com/us/app/super-hexagon/id609274853?mt=12

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Mac App Store Apps
mas 'Xcode', id: 497799835
mas '1Password', id: 1333542190
mas 'Amphetamine', id: 937984704
# mas 'Bear', id: 1091189122
# mas 'Day One', id: 1055511498
# mas 'GIF Brewery 3', id: 1081413713
mas 'Keynote', id: 409183694
mas 'LIMBO', id: 481629890
# mas 'Monosnap', id: 540348655
# mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'VPN Unlimited', id: 727593140
# mas 'WhatsApp', id: 1147396723
