# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'

# Binaries
brew 'antigen'
brew 'bat'
brew 'coreutils'
brew 'dark-mode'
brew 'diff-so-fancy'
brew 'dockutil'
brew 'exa'
brew 'fd'
brew 'ffmpeg'
brew 'fpp'
brew 'fzf'
brew 'git-recent'
brew 'git'
brew 'googler'
brew 'grep'
brew 'grip'
brew 'hh'
brew 'hr'
brew 'httpie'
brew 'hyperfine'
brew 'imagemagick'
brew 'mas'
brew 'peco'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'tokei'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'wifi-password'
brew 'xsv'
brew 'youtube-dl'
brew 'z'
brew 'zsh-completions'
brew 'zsh'

# Dev
brew 'mysql'
brew 'node'
brew 'php'

# Apps
cask 'alfred'
cask 'astro'
cask 'avast-security'
cask 'caskroom/versions/firefox-developer-edition'
cask 'caskroom/versions/google-chrome-canary'
cask 'cleanapp'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'font-ibm-plex'
cask 'gitkraken'
cask 'google-chrome'
cask 'grammarly'
cask 'hyper'
cask 'insomnia'
cask 'iterm2'
cask 'kap'
cask 'licecap'
cask 'macdown'
cask 'now'
cask 'opera'
cask 'postman'
cask 'screenflow'
cask 'shuttle'
cask 'spectacle'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'viber'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# Install manually
# Bartender, https://goo.gl/HPn1tK
# PhraseExpress, https://goo.gl/LwPtdT
# iStat-Menus, https://goo.gl/GmXAdm
# Colorpicker, https://goo.gl/wgPvMM
# Sketch, https://goo.gl/2ziRQX
# Space Drop, https://goo.gl/RNAKtU
# Super Hexagon, https://goo.gl/hyfTRc

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Mac App Store Apps
mas 'Xcode', id: 497799835
mas '1Password', id: 1333542190
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'CopyClip', id: 595191960
mas 'Day One', id: 1055511498
mas 'Keynote', id: 409183694
mas 'LIMBO', id: 481629890
mas 'Monosnap', id: 540348655
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'VPN Unlimited', id: 727593140
mas 'WhatsApp', id: 1147396723
